###############################################################################
# Created by write_sdc
# Tue Apr  7 19:44:01 2026
###############################################################################
current_design address_coalescer_m
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 
set_clock_uncertainty 0.2500 clk
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {arb_port_o[413]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[412]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[411]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[410]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[409]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[408]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[407]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[406]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[405]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[404]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[403]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[402]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[401]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[400]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[399]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[398]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[397]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[396]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[395]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[394]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[393]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[392]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[391]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[390]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[389]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[388]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[387]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[386]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[385]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[384]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[383]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[382]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[381]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[380]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[379]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[378]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[377]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[376]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[375]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[374]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[373]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[372]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[371]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[370]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[369]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[368]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[367]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[366]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[365]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[364]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[363]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[362]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[361]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[360]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[359]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[358]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[357]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[356]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[355]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[354]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[353]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[352]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[351]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[350]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[349]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[348]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[347]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[346]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[345]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[344]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[343]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[342]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[341]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[340]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[339]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[338]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[337]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[336]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[335]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[334]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[333]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[332]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[331]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[330]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[329]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[328]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[327]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[326]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[325]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[324]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[323]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[322]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[321]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[320]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[319]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[318]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[317]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[316]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[315]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[314]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[313]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[312]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[311]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[310]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[309]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[308]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[307]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[306]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[305]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[304]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[303]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[302]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[301]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[300]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[299]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[298]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[297]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[296]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[295]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[294]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[293]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[292]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[291]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[290]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[289]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[288]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[287]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[286]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[285]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[284]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[283]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[282]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[281]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[280]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[279]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[278]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[277]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[276]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[275]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[274]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[273]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[272]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[271]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[270]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[269]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[268]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[267]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[266]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[265]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[264]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[263]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[262]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[261]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[260]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[259]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[258]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[257]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[256]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[255]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[254]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[253]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[252]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[251]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[250]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[249]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[248]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[247]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[246]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[245]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[244]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[243]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[242]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[241]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[240]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[239]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[238]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[237]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[236]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[235]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[234]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[233]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[232]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[231]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[230]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[229]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[228]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[227]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[226]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[225]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[224]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[223]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[222]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[221]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[220]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[219]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[218]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[217]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[216]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[215]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[214]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[213]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[212]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[211]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[210]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[209]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[208]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[207]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[206]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[205]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[204]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[203]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[202]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[201]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[200]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[199]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[198]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[197]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[196]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[195]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[194]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[193]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[192]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[191]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[190]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[189]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[188]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[187]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[186]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[185]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[184]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[183]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[182]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[181]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[180]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[179]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[178]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[177]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[176]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[175]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[174]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[173]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[172]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[171]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[170]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[169]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[168]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[167]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[166]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[165]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[164]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[163]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[162]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[161]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[160]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[159]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[158]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[157]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[156]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[155]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[154]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[153]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[152]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[151]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[150]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[149]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[148]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[147]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[146]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[145]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[144]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[143]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[142]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[141]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[140]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[139]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[138]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[137]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[136]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[135]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[134]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[133]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[132]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[131]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[130]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[129]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[128]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[127]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[126]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[125]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[124]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[123]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[122]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[121]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[120]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[119]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[118]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[117]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[116]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[115]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[114]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[113]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[112]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[111]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[110]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[109]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[108]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[107]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[106]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[105]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[104]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[103]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[102]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[101]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[100]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[99]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[98]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[97]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[96]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[95]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[94]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[93]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[92]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[91]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[90]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[89]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[88]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[87]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[86]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[85]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[84]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[83]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[82]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[81]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[80]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[79]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[78]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[77]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[76]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[75]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[74]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[73]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[72]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[71]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[70]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[69]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[68]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[67]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[66]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[65]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[64]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[63]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[62]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[61]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[60]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[59]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[58]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[57]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[56]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[55]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[54]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[53]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[52]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[51]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[50]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[49]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[48]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[47]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[46]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[45]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[44]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[43]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[42]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[41]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[40]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[39]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[38]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[37]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[36]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[35]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[34]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[33]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[32]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[31]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[30]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[29]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[28]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[27]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[26]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[25]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[24]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[23]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[22]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[21]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[20]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[19]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[18]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[17]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[16]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[15]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[14]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[13]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[12]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[11]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[10]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[9]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[8]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[7]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[6]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[5]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[4]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[3]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[2]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[1]}]
set_load -pin_load 0.1900 [get_ports {arb_port_o[0]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[203]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[202]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[201]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[200]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[199]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[198]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[197]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[196]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[195]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[194]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[193]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[192]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[191]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[190]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[189]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[188]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[187]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[186]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[185]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[184]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[183]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[182]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[181]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[180]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[179]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[178]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[177]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[176]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[175]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[174]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[173]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[172]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[171]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[170]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[169]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[168]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[167]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[166]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[165]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[164]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[163]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[162]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[161]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[160]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[159]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[158]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[157]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[156]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[155]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[154]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[153]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[152]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[151]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[150]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[149]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[148]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[147]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[146]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[145]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[144]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[143]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[142]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[141]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[140]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[139]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[138]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[137]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[136]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[135]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[134]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[133]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[132]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[131]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[130]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[129]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[128]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[127]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[126]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[125]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[124]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[123]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[122]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[121]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[120]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[119]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[118]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[117]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[116]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[115]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[114]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[113]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[112]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[111]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[110]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[109]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[108]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[107]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[106]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[105]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[104]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[103]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[102]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[101]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[100]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[99]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[98]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[97]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[96]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[95]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[94]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[93]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[92]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[91]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[90]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[89]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[88]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[87]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[86]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[85]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[84]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[83]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[82]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[81]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[80]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[79]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[78]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[77]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[76]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[75]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[74]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[73]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[72]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[71]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[70]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[69]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[68]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[67]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[66]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[65]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[64]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[63]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[62]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[61]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[60]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[59]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[58]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[57]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[56]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[55]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[54]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[53]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[52]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[51]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[50]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[49]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[48]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[47]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[46]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[45]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[44]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[43]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[42]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[41]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[40]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[39]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[38]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[37]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[36]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[35]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[34]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[33]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[32]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[31]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[30]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[29]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[28]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[27]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[26]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[25]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[24]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[23]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[22]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[21]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[20]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[19]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[18]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[17]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[16]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[15]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[14]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[13]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[12]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[11]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[10]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[9]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[8]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[7]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[6]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[5]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[4]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[3]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[2]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[1]}]
set_load -pin_load 0.1900 [get_ports {core_port_o[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
