###############################################################################
# Created by write_sdc
# Thu Mar 12 17:59:15 2026
###############################################################################
current_design CF_SRAM_1024x32_wrapper
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name CLKin -period 25.0000 [get_ports {CLKin}]
set_clock_transition 0.1500 [get_clocks {CLKin}]
set_clock_uncertainty 0.2500 CLKin
set_propagated_clock [get_clocks {CLKin}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {AD[0]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {AD[1]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {AD[2]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {AD[3]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {AD[4]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {AD[5]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {AD[6]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {AD[7]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {AD[8]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {AD[9]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[0]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[10]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[11]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[12]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[13]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[14]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[15]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[16]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[17]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[18]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[19]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[1]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[20]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[21]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[22]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[23]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[24]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[25]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[26]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[27]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[28]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[29]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[2]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[30]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[31]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[3]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[4]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[5]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[6]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[7]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[8]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {BEN[9]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[0]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[10]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[11]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[12]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[13]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[14]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[15]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[16]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[17]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[18]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[19]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[1]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[20]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[21]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[22]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[23]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[24]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[25]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[26]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[27]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[28]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[29]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[2]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[30]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[31]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[3]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[4]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[5]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[6]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[7]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[8]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DI[9]}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {EN}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {R_WB}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {SM}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {ScanInCC}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {ScanInDL}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {ScanInDR}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {TM}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {WLBI}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {WLOFF}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {vpwrac}]
set_input_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {vpwrpc}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[0]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[10]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[11]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[12]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[13]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[14]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[15]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[16]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[17]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[18]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[19]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[1]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[20]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[21]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[22]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[23]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[24]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[25]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[26]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[27]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[28]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[29]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[2]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[30]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[31]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[3]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[4]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[5]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[6]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[7]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[8]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {DO[9]}]
set_output_delay 5.0000 -clock [get_clocks {CLKin}] -add_delay [get_ports {ScanOutCC}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {ScanOutCC}]
set_load -pin_load 0.0334 [get_ports {DO[31]}]
set_load -pin_load 0.0334 [get_ports {DO[30]}]
set_load -pin_load 0.0334 [get_ports {DO[29]}]
set_load -pin_load 0.0334 [get_ports {DO[28]}]
set_load -pin_load 0.0334 [get_ports {DO[27]}]
set_load -pin_load 0.0334 [get_ports {DO[26]}]
set_load -pin_load 0.0334 [get_ports {DO[25]}]
set_load -pin_load 0.0334 [get_ports {DO[24]}]
set_load -pin_load 0.0334 [get_ports {DO[23]}]
set_load -pin_load 0.0334 [get_ports {DO[22]}]
set_load -pin_load 0.0334 [get_ports {DO[21]}]
set_load -pin_load 0.0334 [get_ports {DO[20]}]
set_load -pin_load 0.0334 [get_ports {DO[19]}]
set_load -pin_load 0.0334 [get_ports {DO[18]}]
set_load -pin_load 0.0334 [get_ports {DO[17]}]
set_load -pin_load 0.0334 [get_ports {DO[16]}]
set_load -pin_load 0.0334 [get_ports {DO[15]}]
set_load -pin_load 0.0334 [get_ports {DO[14]}]
set_load -pin_load 0.0334 [get_ports {DO[13]}]
set_load -pin_load 0.0334 [get_ports {DO[12]}]
set_load -pin_load 0.0334 [get_ports {DO[11]}]
set_load -pin_load 0.0334 [get_ports {DO[10]}]
set_load -pin_load 0.0334 [get_ports {DO[9]}]
set_load -pin_load 0.0334 [get_ports {DO[8]}]
set_load -pin_load 0.0334 [get_ports {DO[7]}]
set_load -pin_load 0.0334 [get_ports {DO[6]}]
set_load -pin_load 0.0334 [get_ports {DO[5]}]
set_load -pin_load 0.0334 [get_ports {DO[4]}]
set_load -pin_load 0.0334 [get_ports {DO[3]}]
set_load -pin_load 0.0334 [get_ports {DO[2]}]
set_load -pin_load 0.0334 [get_ports {DO[1]}]
set_load -pin_load 0.0334 [get_ports {DO[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CLKin}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {EN}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {R_WB}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SM}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ScanInCC}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ScanInDL}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ScanInDR}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {TM}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WLBI}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WLOFF}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vpwrac}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {vpwrpc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AD[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AD[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AD[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AD[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AD[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AD[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AD[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AD[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AD[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AD[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BEN[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {DI[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
