###############################################################################
# Created by write_sdc
# Thu Apr  9 15:49:49 2026
###############################################################################
current_design core_controller_wrapper_m
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 
set_clock_uncertainty 0.2500 clk
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -add_delay [get_ports {wb_rst_i}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[0]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[0]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[10]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[10]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[11]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[11]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[12]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[12]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[13]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[13]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[14]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[14]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[15]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[15]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[16]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[16]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[17]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[17]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[18]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[18]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[19]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[19]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[1]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[1]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[20]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[20]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[21]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[21]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[22]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[22]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[23]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[23]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[24]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[24]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[25]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[25]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[26]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[26]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[27]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[27]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[28]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[28]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[29]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[29]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[2]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[2]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[30]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[30]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[31]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[31]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[3]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[3]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[4]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[4]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[5]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[5]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[6]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[6]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[7]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[7]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[8]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[8]}]
set_input_delay 0.7900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_adr_i[9]}]
set_input_delay 3.8900 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_adr_i[9]}]
set_input_delay 1.6900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_cyc_i}]
set_input_delay 4.7400 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_cyc_i}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[0]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[0]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[10]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[10]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[11]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[11]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[12]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[12]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[13]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[13]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[14]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[14]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[15]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[15]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[16]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[16]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[17]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[17]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[18]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[18]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[19]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[19]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[1]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[1]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[20]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[20]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[21]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[21]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[22]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[22]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[23]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[23]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[24]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[24]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[25]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[25]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[26]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[26]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[27]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[27]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[28]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[28]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[29]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[29]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[2]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[2]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[30]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[30]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[31]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[31]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[3]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[3]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[4]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[4]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[5]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[5]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[6]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[6]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[7]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[7]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[8]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[8]}]
set_input_delay 1.0400 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_dat_i[9]}]
set_input_delay 4.6100 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_dat_i[9]}]
set_input_delay 1.1900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_sel_i[0]}]
set_input_delay 3.1700 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_sel_i[0]}]
set_input_delay 1.1900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_sel_i[1]}]
set_input_delay 3.1700 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_sel_i[1]}]
set_input_delay 1.1900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_sel_i[2]}]
set_input_delay 3.1700 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_sel_i[2]}]
set_input_delay 1.1900 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_sel_i[3]}]
set_input_delay 3.1700 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_sel_i[3]}]
set_input_delay 1.6500 -clock [get_clocks {clk}] -min -add_delay [get_ports {wbs_we_i}]
set_input_delay 3.7400 -clock [get_clocks {clk}] -max -add_delay [get_ports {wbs_we_i}]
set_multicycle_path -hold\
    -through [get_ports {wbs_cyc_i}] 1
set_multicycle_path -setup\
    -through [get_ports {wbs_cyc_i}] 2
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {core_jump_o}]
set_load -pin_load 0.1900 [get_ports {fragfifo_clear_o}]
set_load -pin_load 0.1900 [get_ports {irq_batchdone_o}]
set_load -pin_load 0.1900 [get_ports {irq_jobdone_o}]
set_load -pin_load 0.1900 [get_ports {vertcache_clear_o}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_valid_o}]
set_load -pin_load 0.1900 [get_ports {vertorder_clear_o}]
set_load -pin_load 0.1900 [get_ports {wbs_ack_control_o}]
set_load -pin_load 0.1900 [get_ports {wbs_ack_imem_o}]
set_load -pin_load 0.1900 [get_ports {core_reset_mailbox_o[2]}]
set_load -pin_load 0.1900 [get_ports {core_reset_mailbox_o[1]}]
set_load -pin_load 0.1900 [get_ports {core_reset_mailbox_o[0]}]
set_load -pin_load 0.1900 [get_ports {core_reset_o[2]}]
set_load -pin_load 0.1900 [get_ports {core_reset_o[1]}]
set_load -pin_load 0.1900 [get_ports {core_reset_o[0]}]
set_load -pin_load 0.1900 [get_ports {core_stall_o[2]}]
set_load -pin_load 0.1900 [get_ports {core_stall_o[1]}]
set_load -pin_load 0.1900 [get_ports {core_stall_o[0]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[31]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[30]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[29]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[28]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[27]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[26]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[25]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[24]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[23]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[22]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[21]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[20]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[19]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[18]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[17]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[16]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[15]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[14]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[13]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[12]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[11]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[10]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[9]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[8]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[7]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[6]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[5]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[4]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[3]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[2]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[1]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs1_data_o[0]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[31]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[30]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[29]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[28]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[27]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[26]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[25]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[24]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[23]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[22]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[21]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[20]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[19]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[18]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[17]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[16]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[15]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[14]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[13]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[12]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[11]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[10]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[9]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[8]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[7]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[6]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[5]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[4]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[3]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[2]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[1]}]
set_load -pin_load 0.1900 [get_ports {global_regfile_rs2_data_o[0]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[33]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[32]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[31]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[30]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[29]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[28]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[27]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[26]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[25]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[24]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[23]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[22]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[21]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[20]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[19]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[18]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[17]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[16]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[15]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[14]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[13]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[12]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[11]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[10]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[9]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[8]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[7]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[6]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[5]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[4]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[3]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[2]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[1]}]
set_load -pin_load 0.1900 [get_ports {index_mstream_o[0]}]
set_load -pin_load 0.1900 [get_ports {inst_o[31]}]
set_load -pin_load 0.1900 [get_ports {inst_o[30]}]
set_load -pin_load 0.1900 [get_ports {inst_o[29]}]
set_load -pin_load 0.1900 [get_ports {inst_o[28]}]
set_load -pin_load 0.1900 [get_ports {inst_o[27]}]
set_load -pin_load 0.1900 [get_ports {inst_o[26]}]
set_load -pin_load 0.1900 [get_ports {inst_o[25]}]
set_load -pin_load 0.1900 [get_ports {inst_o[24]}]
set_load -pin_load 0.1900 [get_ports {inst_o[23]}]
set_load -pin_load 0.1900 [get_ports {inst_o[22]}]
set_load -pin_load 0.1900 [get_ports {inst_o[21]}]
set_load -pin_load 0.1900 [get_ports {inst_o[20]}]
set_load -pin_load 0.1900 [get_ports {inst_o[19]}]
set_load -pin_load 0.1900 [get_ports {inst_o[18]}]
set_load -pin_load 0.1900 [get_ports {inst_o[17]}]
set_load -pin_load 0.1900 [get_ports {inst_o[16]}]
set_load -pin_load 0.1900 [get_ports {inst_o[15]}]
set_load -pin_load 0.1900 [get_ports {inst_o[14]}]
set_load -pin_load 0.1900 [get_ports {inst_o[13]}]
set_load -pin_load 0.1900 [get_ports {inst_o[12]}]
set_load -pin_load 0.1900 [get_ports {inst_o[11]}]
set_load -pin_load 0.1900 [get_ports {inst_o[10]}]
set_load -pin_load 0.1900 [get_ports {inst_o[9]}]
set_load -pin_load 0.1900 [get_ports {inst_o[8]}]
set_load -pin_load 0.1900 [get_ports {inst_o[7]}]
set_load -pin_load 0.1900 [get_ports {inst_o[6]}]
set_load -pin_load 0.1900 [get_ports {inst_o[5]}]
set_load -pin_load 0.1900 [get_ports {inst_o[4]}]
set_load -pin_load 0.1900 [get_ports {inst_o[3]}]
set_load -pin_load 0.1900 [get_ports {inst_o[2]}]
set_load -pin_load 0.1900 [get_ports {inst_o[1]}]
set_load -pin_load 0.1900 [get_ports {inst_o[0]}]
set_load -pin_load 0.1900 [get_ports {mport_o[68]}]
set_load -pin_load 0.1900 [get_ports {mport_o[67]}]
set_load -pin_load 0.1900 [get_ports {mport_o[66]}]
set_load -pin_load 0.1900 [get_ports {mport_o[65]}]
set_load -pin_load 0.1900 [get_ports {mport_o[64]}]
set_load -pin_load 0.1900 [get_ports {mport_o[63]}]
set_load -pin_load 0.1900 [get_ports {mport_o[62]}]
set_load -pin_load 0.1900 [get_ports {mport_o[61]}]
set_load -pin_load 0.1900 [get_ports {mport_o[60]}]
set_load -pin_load 0.1900 [get_ports {mport_o[59]}]
set_load -pin_load 0.1900 [get_ports {mport_o[58]}]
set_load -pin_load 0.1900 [get_ports {mport_o[57]}]
set_load -pin_load 0.1900 [get_ports {mport_o[56]}]
set_load -pin_load 0.1900 [get_ports {mport_o[55]}]
set_load -pin_load 0.1900 [get_ports {mport_o[54]}]
set_load -pin_load 0.1900 [get_ports {mport_o[53]}]
set_load -pin_load 0.1900 [get_ports {mport_o[52]}]
set_load -pin_load 0.1900 [get_ports {mport_o[51]}]
set_load -pin_load 0.1900 [get_ports {mport_o[50]}]
set_load -pin_load 0.1900 [get_ports {mport_o[49]}]
set_load -pin_load 0.1900 [get_ports {mport_o[48]}]
set_load -pin_load 0.1900 [get_ports {mport_o[47]}]
set_load -pin_load 0.1900 [get_ports {mport_o[46]}]
set_load -pin_load 0.1900 [get_ports {mport_o[45]}]
set_load -pin_load 0.1900 [get_ports {mport_o[44]}]
set_load -pin_load 0.1900 [get_ports {mport_o[43]}]
set_load -pin_load 0.1900 [get_ports {mport_o[42]}]
set_load -pin_load 0.1900 [get_ports {mport_o[41]}]
set_load -pin_load 0.1900 [get_ports {mport_o[40]}]
set_load -pin_load 0.1900 [get_ports {mport_o[39]}]
set_load -pin_load 0.1900 [get_ports {mport_o[38]}]
set_load -pin_load 0.1900 [get_ports {mport_o[37]}]
set_load -pin_load 0.1900 [get_ports {mport_o[36]}]
set_load -pin_load 0.1900 [get_ports {mport_o[35]}]
set_load -pin_load 0.1900 [get_ports {mport_o[34]}]
set_load -pin_load 0.1900 [get_ports {mport_o[33]}]
set_load -pin_load 0.1900 [get_ports {mport_o[32]}]
set_load -pin_load 0.1900 [get_ports {mport_o[31]}]
set_load -pin_load 0.1900 [get_ports {mport_o[30]}]
set_load -pin_load 0.1900 [get_ports {mport_o[29]}]
set_load -pin_load 0.1900 [get_ports {mport_o[28]}]
set_load -pin_load 0.1900 [get_ports {mport_o[27]}]
set_load -pin_load 0.1900 [get_ports {mport_o[26]}]
set_load -pin_load 0.1900 [get_ports {mport_o[25]}]
set_load -pin_load 0.1900 [get_ports {mport_o[24]}]
set_load -pin_load 0.1900 [get_ports {mport_o[23]}]
set_load -pin_load 0.1900 [get_ports {mport_o[22]}]
set_load -pin_load 0.1900 [get_ports {mport_o[21]}]
set_load -pin_load 0.1900 [get_ports {mport_o[20]}]
set_load -pin_load 0.1900 [get_ports {mport_o[19]}]
set_load -pin_load 0.1900 [get_ports {mport_o[18]}]
set_load -pin_load 0.1900 [get_ports {mport_o[17]}]
set_load -pin_load 0.1900 [get_ports {mport_o[16]}]
set_load -pin_load 0.1900 [get_ports {mport_o[15]}]
set_load -pin_load 0.1900 [get_ports {mport_o[14]}]
set_load -pin_load 0.1900 [get_ports {mport_o[13]}]
set_load -pin_load 0.1900 [get_ports {mport_o[12]}]
set_load -pin_load 0.1900 [get_ports {mport_o[11]}]
set_load -pin_load 0.1900 [get_ports {mport_o[10]}]
set_load -pin_load 0.1900 [get_ports {mport_o[9]}]
set_load -pin_load 0.1900 [get_ports {mport_o[8]}]
set_load -pin_load 0.1900 [get_ports {mport_o[7]}]
set_load -pin_load 0.1900 [get_ports {mport_o[6]}]
set_load -pin_load 0.1900 [get_ports {mport_o[5]}]
set_load -pin_load 0.1900 [get_ports {mport_o[4]}]
set_load -pin_load 0.1900 [get_ports {mport_o[3]}]
set_load -pin_load 0.1900 [get_ports {mport_o[2]}]
set_load -pin_load 0.1900 [get_ports {mport_o[1]}]
set_load -pin_load 0.1900 [get_ports {mport_o[0]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[31]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[30]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[29]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[28]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[27]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[26]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[25]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[24]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[23]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[22]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[21]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[20]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[19]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[18]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[17]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[16]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[15]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[14]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[13]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[12]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[11]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[10]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[9]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[8]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[7]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[6]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[5]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[4]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[3]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[2]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[1]}]
set_load -pin_load 0.1900 [get_ports {vertcache_test_index_o[0]}]
set_load -pin_load 0.1900 [get_ports {vertorder_mstream_o[3]}]
set_load -pin_load 0.1900 [get_ports {vertorder_mstream_o[2]}]
set_load -pin_load 0.1900 [get_ports {vertorder_mstream_o[1]}]
set_load -pin_load 0.1900 [get_ports {vertorder_mstream_o[0]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[31]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[30]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[29]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[28]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[27]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[26]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[25]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[24]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[23]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[22]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[21]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[20]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[19]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[18]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[17]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[16]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[15]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[14]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[13]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[12]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[11]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[10]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[9]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[8]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[7]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[6]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[5]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[4]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[3]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[2]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[1]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_control_o[0]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[31]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[30]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[29]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[28]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[27]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[26]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[25]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[24]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[23]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[22]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[21]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[20]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[19]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[18]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[17]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[16]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[15]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[14]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[13]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[12]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[11]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[10]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[9]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[8]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[7]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[6]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[5]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[4]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[3]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[2]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[1]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_imem_o[0]}]
set_input_transition -min 0.0900 [get_ports {wbs_cyc_i}]
set_input_transition -max 0.1700 [get_ports {wbs_cyc_i}]
set_input_transition -min 0.0900 [get_ports {wbs_we_i}]
set_input_transition -max 0.1400 [get_ports {wbs_we_i}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[31]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[31]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[30]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[30]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[29]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[29]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[28]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[28]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[27]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[27]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[26]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[26]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[25]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[25]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[24]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[24]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[23]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[23]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[22]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[22]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[21]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[21]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[20]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[20]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[19]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[19]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[18]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[18]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[17]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[17]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[16]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[16]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[15]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[15]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[14]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[14]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[13]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[13]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[12]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[12]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[11]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[11]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[10]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[10]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[9]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[9]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[8]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[8]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[7]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[7]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[6]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[6]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[5]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[5]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[4]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[4]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[3]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[3]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[2]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[2]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[1]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[1]}]
set_input_transition -min 0.0700 [get_ports {wbs_adr_i[0]}]
set_input_transition -max 0.9200 [get_ports {wbs_adr_i[0]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[31]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[31]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[30]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[30]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[29]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[29]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[28]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[28]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[27]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[27]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[26]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[26]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[25]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[25]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[24]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[24]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[23]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[23]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[22]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[22]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[21]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[21]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[20]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[20]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[19]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[19]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[18]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[18]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[17]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[17]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[16]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[16]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[15]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[15]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[14]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[14]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[13]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[13]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[12]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[12]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[11]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[11]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[10]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[10]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[9]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[9]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[8]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[8]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[7]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[7]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[6]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[6]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[5]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[5]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[4]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[4]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[3]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[3]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[2]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[2]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[1]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[1]}]
set_input_transition -min 0.0700 [get_ports {wbs_dat_i[0]}]
set_input_transition -max 0.8400 [get_ports {wbs_dat_i[0]}]
set_input_transition -min 0.0900 [get_ports {wbs_sel_i[3]}]
set_input_transition -max 0.1800 [get_ports {wbs_sel_i[3]}]
set_input_transition -min 0.0900 [get_ports {wbs_sel_i[2]}]
set_input_transition -max 0.1800 [get_ports {wbs_sel_i[2]}]
set_input_transition -min 0.0900 [get_ports {wbs_sel_i[1]}]
set_input_transition -max 0.1800 [get_ports {wbs_sel_i[1]}]
set_input_transition -min 0.0900 [get_ports {wbs_sel_i[0]}]
set_input_transition -max 0.1800 [get_ports {wbs_sel_i[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
