###############################################################################
# Created by write_sdc
# Wed Apr  8 18:27:09 2026
###############################################################################
current_design metadata_cache_m
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 
set_clock_uncertainty 0.2500 clk
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {m_mem_o[68]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[67]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[66]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[65]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[64]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[63]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[62]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[61]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[60]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[59]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[58]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[57]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[56]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[55]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[54]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[53]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[52]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[51]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[50]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[49]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[48]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[47]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[46]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[45]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[44]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[43]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[42]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[41]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[40]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[39]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[38]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[37]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[36]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[35]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[34]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[33]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[32]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[31]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[30]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[29]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[28]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[27]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[26]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[25]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[24]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[23]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[22]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[21]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[20]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[19]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[18]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[17]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[16]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[15]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[14]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[13]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[12]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[11]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[10]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[9]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[8]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[7]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[6]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[5]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[4]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[3]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[2]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[1]}]
set_load -pin_load 0.1900 [get_ports {m_mem_o[0]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[33]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[32]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[31]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[30]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[29]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[28]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[27]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[26]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[25]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[24]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[23]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[22]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[21]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[20]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[19]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[18]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[17]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[16]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[15]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[14]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[13]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[12]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[11]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[10]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[9]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[8]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[7]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[6]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[5]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[4]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[3]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[2]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[1]}]
set_load -pin_load 0.1900 [get_ports {s_core_o[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
